earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Raspberry Pi Pico W (Picoprobe)
# -----------------------------------
rpipicowpicoprobe.name=Raspberry Pi Pico W (Picoprobe)
rpipicowpicoprobe.vid.0=0x2e8a
rpipicowpicoprobe.pid.0=0x0004
rpipicowpicoprobe.build.usbpid=-DSERIALUSB_PID=0xf00a
rpipicowpicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicowpicoprobe.build.board=RASPBERRY_PI_PICO_W
rpipicowpicoprobe.build.mcu=cortex-m0plus
rpipicowpicoprobe.build.variant=rpipicow
rpipicowpicoprobe.upload.tool=picoprobe
rpipicowpicoprobe.upload.maximum_size=2097152
rpipicowpicoprobe.upload.maximum_data_size=262144
rpipicowpicoprobe.upload.wait_for_upload_port=true
rpipicowpicoprobe.upload.erase_cmd=
rpipicowpicoprobe.serial.disableDTR=false
rpipicowpicoprobe.serial.disableRTS=false
rpipicowpicoprobe.build.f_cpu=125000000
rpipicowpicoprobe.build.led=
rpipicowpicoprobe.build.core=rp2040
rpipicowpicoprobe.build.ldscript=memmap_default.ld
rpipicowpicoprobe.build.ram_length=256k
rpipicowpicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
rpipicowpicoprobe.build.vid=0x2e8a
rpipicowpicoprobe.build.pid=0xf00a
rpipicowpicoprobe.build.usb_manufacturer="Raspberry Pi"
rpipicowpicoprobe.build.usb_product="Pico W (Picoprobe)"
rpipicowpicoprobe.menu.flash.2097152_0=2MB (no FS)
rpipicowpicoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicowpicoprobe.menu.flash.2097152_0.build.flash_length=2093056
rpipicowpicoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_0.build.fs_start=270528512
rpipicowpicoprobe.menu.flash.2097152_0.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicowpicoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicowpicoprobe.menu.flash.2097152_65536.build.flash_length=2027520
rpipicowpicoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_65536.build.fs_start=270462976
rpipicowpicoprobe.menu.flash.2097152_65536.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicowpicoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicowpicoprobe.menu.flash.2097152_131072.build.flash_length=1961984
rpipicowpicoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_131072.build.fs_start=270397440
rpipicowpicoprobe.menu.flash.2097152_131072.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicowpicoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicowpicoprobe.menu.flash.2097152_262144.build.flash_length=1830912
rpipicowpicoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_262144.build.fs_start=270266368
rpipicowpicoprobe.menu.flash.2097152_262144.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicowpicoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicowpicoprobe.menu.flash.2097152_524288.build.flash_length=1568768
rpipicowpicoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_524288.build.fs_start=270004224
rpipicowpicoprobe.menu.flash.2097152_524288.build.fs_end=270528512
rpipicowpicoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicowpicoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicowpicoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicowpicoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicowpicoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicowpicoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicowpicoprobe.menu.freq.133=133 MHz
rpipicowpicoprobe.menu.freq.133.build.f_cpu=133000000L
rpipicowpicoprobe.menu.freq.50=50 MHz
rpipicowpicoprobe.menu.freq.50.build.f_cpu=50000000L
rpipicowpicoprobe.menu.freq.100=100 MHz
rpipicowpicoprobe.menu.freq.100.build.f_cpu=100000000L
rpipicowpicoprobe.menu.freq.120=120 MHz
rpipicowpicoprobe.menu.freq.120.build.f_cpu=120000000L
rpipicowpicoprobe.menu.freq.125=125 MHz
rpipicowpicoprobe.menu.freq.125.build.f_cpu=125000000L
rpipicowpicoprobe.menu.freq.150=150 MHz (Overclock)
rpipicowpicoprobe.menu.freq.150.build.f_cpu=150000000L
rpipicowpicoprobe.menu.freq.175=175 MHz (Overclock)
rpipicowpicoprobe.menu.freq.175.build.f_cpu=175000000L
rpipicowpicoprobe.menu.freq.200=200 MHz (Overclock)
rpipicowpicoprobe.menu.freq.200.build.f_cpu=200000000L
rpipicowpicoprobe.menu.freq.225=225 MHz (Overclock)
rpipicowpicoprobe.menu.freq.225.build.f_cpu=225000000L
rpipicowpicoprobe.menu.freq.240=240 MHz (Overclock)
rpipicowpicoprobe.menu.freq.240.build.f_cpu=240000000L
rpipicowpicoprobe.menu.freq.250=250 MHz (Overclock)
rpipicowpicoprobe.menu.freq.250.build.f_cpu=250000000L
rpipicowpicoprobe.menu.freq.275=275 MHz (Overclock)
rpipicowpicoprobe.menu.freq.275.build.f_cpu=275000000L
rpipicowpicoprobe.menu.freq.300=300 MHz (Overclock)
rpipicowpicoprobe.menu.freq.300.build.f_cpu=300000000L
rpipicowpicoprobe.menu.opt.Small=Small (-Os) (standard)
rpipicowpicoprobe.menu.opt.Small.build.flags.optimize=-Os
rpipicowpicoprobe.menu.opt.Optimize=Optimize (-O)
rpipicowpicoprobe.menu.opt.Optimize.build.flags.optimize=-O
rpipicowpicoprobe.menu.opt.Optimize2=Optimize More (-O2)
rpipicowpicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicowpicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicowpicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicowpicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicowpicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicowpicoprobe.menu.opt.Debug=Debug (-Og)
rpipicowpicoprobe.menu.opt.Debug.build.flags.optimize=-Og
rpipicowpicoprobe.menu.rtti.Disabled=Disabled
rpipicowpicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicowpicoprobe.menu.rtti.Enabled=Enabled
rpipicowpicoprobe.menu.rtti.Enabled.build.flags.rtti=
rpipicowpicoprobe.menu.stackprotect.Disabled=Disabled
rpipicowpicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipicowpicoprobe.menu.stackprotect.Enabled=Enabled
rpipicowpicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rpipicowpicoprobe.menu.exceptions.Disabled=Disabled
rpipicowpicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipicowpicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipicowpicoprobe.menu.exceptions.Enabled=Enabled
rpipicowpicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipicowpicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipicowpicoprobe.menu.dbgport.Disabled=Disabled
rpipicowpicoprobe.menu.dbgport.Disabled.build.debug_port=
rpipicowpicoprobe.menu.dbgport.Serial=Serial
rpipicowpicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicowpicoprobe.menu.dbgport.Serial1=Serial1
rpipicowpicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicowpicoprobe.menu.dbgport.Serial2=Serial2
rpipicowpicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicowpicoprobe.menu.dbglvl.None=None
rpipicowpicoprobe.menu.dbglvl.None.build.debug_level=
rpipicowpicoprobe.menu.dbglvl.Core=Core
rpipicowpicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicowpicoprobe.menu.dbglvl.SPI=SPI
rpipicowpicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicowpicoprobe.menu.dbglvl.Wire=Wire
rpipicowpicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicowpicoprobe.menu.dbglvl.All=All
rpipicowpicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicowpicoprobe.menu.dbglvl.NDEBUG=NDEBUG
rpipicowpicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicowpicoprobe.menu.usbstack.picosdk=Pico SDK
rpipicowpicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
rpipicowpicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
rpipicowpicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
rpipicowpicoprobe.menu.ipstack.ipv4only=IPv4 Only
rpipicowpicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
rpipicowpicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipicowpicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
rpipicowpicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
rpipicowpicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

# -----------------------------------
# Raspberry Pi Pico W (pico-debug)
# -----------------------------------
rpipicowpicodebug.name=Raspberry Pi Pico W (pico-debug)
rpipicowpicodebug.vid.0=0x1209
rpipicowpicodebug.pid.0=0x2488
rpipicowpicodebug.build.usbpid=-DSERIALUSB_PID=0xf00a
rpipicowpicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
rpipicowpicodebug.build.board=RASPBERRY_PI_PICO_W
rpipicowpicodebug.build.mcu=cortex-m0plus
rpipicowpicodebug.build.variant=rpipicow
rpipicowpicodebug.upload.tool=picodebug
rpipicowpicodebug.upload.maximum_size=2097152
rpipicowpicodebug.upload.maximum_data_size=245760
rpipicowpicodebug.upload.wait_for_upload_port=true
rpipicowpicodebug.upload.erase_cmd=
rpipicowpicodebug.serial.disableDTR=false
rpipicowpicodebug.serial.disableRTS=false
rpipicowpicodebug.build.f_cpu=125000000
rpipicowpicodebug.build.led=
rpipicowpicodebug.build.core=rp2040
rpipicowpicodebug.build.ldscript=memmap_default.ld
rpipicowpicodebug.build.ram_length=240k
rpipicowpicodebug.build.boot2=boot2_w25q080_2_padded_checksum
rpipicowpicodebug.build.vid=0x2e8a
rpipicowpicodebug.build.pid=0xf00a
rpipicowpicodebug.build.usb_manufacturer="Raspberry Pi"
rpipicowpicodebug.build.usb_product="Pico W (pico-debug)"
rpipicowpicodebug.menu.flash.2097152_0=2MB (no FS)
rpipicowpicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
rpipicowpicodebug.menu.flash.2097152_0.build.flash_length=2093056
rpipicowpicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_0.build.fs_start=270528512
rpipicowpicodebug.menu.flash.2097152_0.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
rpipicowpicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
rpipicowpicodebug.menu.flash.2097152_65536.build.flash_length=2027520
rpipicowpicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_65536.build.fs_start=270462976
rpipicowpicodebug.menu.flash.2097152_65536.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
rpipicowpicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
rpipicowpicodebug.menu.flash.2097152_131072.build.flash_length=1961984
rpipicowpicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_131072.build.fs_start=270397440
rpipicowpicodebug.menu.flash.2097152_131072.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
rpipicowpicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
rpipicowpicodebug.menu.flash.2097152_262144.build.flash_length=1830912
rpipicowpicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_262144.build.fs_start=270266368
rpipicowpicodebug.menu.flash.2097152_262144.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
rpipicowpicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
rpipicowpicodebug.menu.flash.2097152_524288.build.flash_length=1568768
rpipicowpicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_524288.build.fs_start=270004224
rpipicowpicodebug.menu.flash.2097152_524288.build.fs_end=270528512
rpipicowpicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
rpipicowpicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
rpipicowpicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
rpipicowpicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
rpipicowpicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
rpipicowpicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
rpipicowpicodebug.menu.freq.133=133 MHz
rpipicowpicodebug.menu.freq.133.build.f_cpu=133000000L
rpipicowpicodebug.menu.freq.50=50 MHz
rpipicowpicodebug.menu.freq.50.build.f_cpu=50000000L
rpipicowpicodebug.menu.freq.100=100 MHz
rpipicowpicodebug.menu.freq.100.build.f_cpu=100000000L
rpipicowpicodebug.menu.freq.120=120 MHz
rpipicowpicodebug.menu.freq.120.build.f_cpu=120000000L
rpipicowpicodebug.menu.freq.125=125 MHz
rpipicowpicodebug.menu.freq.125.build.f_cpu=125000000L
rpipicowpicodebug.menu.freq.150=150 MHz (Overclock)
rpipicowpicodebug.menu.freq.150.build.f_cpu=150000000L
rpipicowpicodebug.menu.freq.175=175 MHz (Overclock)
rpipicowpicodebug.menu.freq.175.build.f_cpu=175000000L
rpipicowpicodebug.menu.freq.200=200 MHz (Overclock)
rpipicowpicodebug.menu.freq.200.build.f_cpu=200000000L
rpipicowpicodebug.menu.freq.225=225 MHz (Overclock)
rpipicowpicodebug.menu.freq.225.build.f_cpu=225000000L
rpipicowpicodebug.menu.freq.240=240 MHz (Overclock)
rpipicowpicodebug.menu.freq.240.build.f_cpu=240000000L
rpipicowpicodebug.menu.freq.250=250 MHz (Overclock)
rpipicowpicodebug.menu.freq.250.build.f_cpu=250000000L
rpipicowpicodebug.menu.freq.275=275 MHz (Overclock)
rpipicowpicodebug.menu.freq.275.build.f_cpu=275000000L
rpipicowpicodebug.menu.freq.300=300 MHz (Overclock)
rpipicowpicodebug.menu.freq.300.build.f_cpu=300000000L
rpipicowpicodebug.menu.opt.Small=Small (-Os) (standard)
rpipicowpicodebug.menu.opt.Small.build.flags.optimize=-Os
rpipicowpicodebug.menu.opt.Optimize=Optimize (-O)
rpipicowpicodebug.menu.opt.Optimize.build.flags.optimize=-O
rpipicowpicodebug.menu.opt.Optimize2=Optimize More (-O2)
rpipicowpicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
rpipicowpicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
rpipicowpicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
rpipicowpicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
rpipicowpicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
rpipicowpicodebug.menu.opt.Debug=Debug (-Og)
rpipicowpicodebug.menu.opt.Debug.build.flags.optimize=-Og
rpipicowpicodebug.menu.rtti.Disabled=Disabled
rpipicowpicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
rpipicowpicodebug.menu.rtti.Enabled=Enabled
rpipicowpicodebug.menu.rtti.Enabled.build.flags.rtti=
rpipicowpicodebug.menu.stackprotect.Disabled=Disabled
rpipicowpicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
rpipicowpicodebug.menu.stackprotect.Enabled=Enabled
rpipicowpicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
rpipicowpicodebug.menu.exceptions.Disabled=Disabled
rpipicowpicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
rpipicowpicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
rpipicowpicodebug.menu.exceptions.Enabled=Enabled
rpipicowpicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
rpipicowpicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
rpipicowpicodebug.menu.dbgport.Disabled=Disabled
rpipicowpicodebug.menu.dbgport.Disabled.build.debug_port=
rpipicowpicodebug.menu.dbgport.Serial=Serial
rpipicowpicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
rpipicowpicodebug.menu.dbgport.Serial1=Serial1
rpipicowpicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
rpipicowpicodebug.menu.dbgport.Serial2=Serial2
rpipicowpicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
rpipicowpicodebug.menu.dbglvl.None=None
rpipicowpicodebug.menu.dbglvl.None.build.debug_level=
rpipicowpicodebug.menu.dbglvl.Core=Core
rpipicowpicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
rpipicowpicodebug.menu.dbglvl.SPI=SPI
rpipicowpicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
rpipicowpicodebug.menu.dbglvl.Wire=Wire
rpipicowpicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
rpipicowpicodebug.menu.dbglvl.All=All
rpipicowpicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
rpipicowpicodebug.menu.dbglvl.NDEBUG=NDEBUG
rpipicowpicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
rpipicowpicodebug.menu.usbstack.nousb=No USB
rpipicowpicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
rpipicowpicodebug.menu.ipstack.ipv4only=IPv4 Only
rpipicowpicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
rpipicowpicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
rpipicowpicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
rpipicowpicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
rpipicowpicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

