earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Adafruit Feather RP2040 (pico-debug)
# -----------------------------------
adafruit_featherpicodebug.name=Adafruit Feather RP2040 (pico-debug)
adafruit_featherpicodebug.vid.0=0x1209
adafruit_featherpicodebug.pid.0=0x2488
adafruit_featherpicodebug.build.usbpid=-DSERIALUSB_PID=0x80f1
adafruit_featherpicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
adafruit_featherpicodebug.build.board=ADAFRUIT_FEATHER_RP2040
adafruit_featherpicodebug.build.mcu=cortex-m0plus
adafruit_featherpicodebug.build.variant=adafruit_feather
adafruit_featherpicodebug.upload.tool=picodebug
adafruit_featherpicodebug.upload.maximum_size=8388608
adafruit_featherpicodebug.upload.maximum_data_size=245760
adafruit_featherpicodebug.upload.wait_for_upload_port=true
adafruit_featherpicodebug.upload.erase_cmd=
adafruit_featherpicodebug.serial.disableDTR=false
adafruit_featherpicodebug.serial.disableRTS=false
adafruit_featherpicodebug.build.f_cpu=125000000
adafruit_featherpicodebug.build.led=
adafruit_featherpicodebug.build.core=rp2040
adafruit_featherpicodebug.build.ldscript=memmap_default.ld
adafruit_featherpicodebug.build.ram_length=240k
adafruit_featherpicodebug.build.boot2=boot2_w25x10cl_4_padded_checksum
adafruit_featherpicodebug.build.vid=0x239a
adafruit_featherpicodebug.build.pid=0x80f1
adafruit_featherpicodebug.build.usb_manufacturer="Adafruit"
adafruit_featherpicodebug.build.usb_product="Feather RP2040 (pico-debug)"
adafruit_featherpicodebug.menu.flash.8388608_0=8MB (no FS)
adafruit_featherpicodebug.menu.flash.8388608_0.upload.maximum_size=8384512
adafruit_featherpicodebug.menu.flash.8388608_0.build.flash_length=8384512
adafruit_featherpicodebug.menu.flash.8388608_0.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_0.build.fs_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_0.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
adafruit_featherpicodebug.menu.flash.8388608_65536.upload.maximum_size=8318976
adafruit_featherpicodebug.menu.flash.8388608_65536.build.flash_length=8318976
adafruit_featherpicodebug.menu.flash.8388608_65536.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_65536.build.fs_start=276754432
adafruit_featherpicodebug.menu.flash.8388608_65536.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
adafruit_featherpicodebug.menu.flash.8388608_131072.upload.maximum_size=8253440
adafruit_featherpicodebug.menu.flash.8388608_131072.build.flash_length=8253440
adafruit_featherpicodebug.menu.flash.8388608_131072.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_131072.build.fs_start=276688896
adafruit_featherpicodebug.menu.flash.8388608_131072.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
adafruit_featherpicodebug.menu.flash.8388608_262144.upload.maximum_size=8122368
adafruit_featherpicodebug.menu.flash.8388608_262144.build.flash_length=8122368
adafruit_featherpicodebug.menu.flash.8388608_262144.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_262144.build.fs_start=276557824
adafruit_featherpicodebug.menu.flash.8388608_262144.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
adafruit_featherpicodebug.menu.flash.8388608_524288.upload.maximum_size=7860224
adafruit_featherpicodebug.menu.flash.8388608_524288.build.flash_length=7860224
adafruit_featherpicodebug.menu.flash.8388608_524288.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_524288.build.fs_start=276295680
adafruit_featherpicodebug.menu.flash.8388608_524288.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
adafruit_featherpicodebug.menu.flash.8388608_1048576.upload.maximum_size=7335936
adafruit_featherpicodebug.menu.flash.8388608_1048576.build.flash_length=7335936
adafruit_featherpicodebug.menu.flash.8388608_1048576.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_1048576.build.fs_start=275771392
adafruit_featherpicodebug.menu.flash.8388608_1048576.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
adafruit_featherpicodebug.menu.flash.8388608_2097152.upload.maximum_size=6287360
adafruit_featherpicodebug.menu.flash.8388608_2097152.build.flash_length=6287360
adafruit_featherpicodebug.menu.flash.8388608_2097152.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_2097152.build.fs_start=274722816
adafruit_featherpicodebug.menu.flash.8388608_2097152.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
adafruit_featherpicodebug.menu.flash.8388608_3145728.upload.maximum_size=5238784
adafruit_featherpicodebug.menu.flash.8388608_3145728.build.flash_length=5238784
adafruit_featherpicodebug.menu.flash.8388608_3145728.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_3145728.build.fs_start=273674240
adafruit_featherpicodebug.menu.flash.8388608_3145728.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
adafruit_featherpicodebug.menu.flash.8388608_4194304.upload.maximum_size=4190208
adafruit_featherpicodebug.menu.flash.8388608_4194304.build.flash_length=4190208
adafruit_featherpicodebug.menu.flash.8388608_4194304.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_4194304.build.fs_start=272625664
adafruit_featherpicodebug.menu.flash.8388608_4194304.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
adafruit_featherpicodebug.menu.flash.8388608_5242880.upload.maximum_size=3141632
adafruit_featherpicodebug.menu.flash.8388608_5242880.build.flash_length=3141632
adafruit_featherpicodebug.menu.flash.8388608_5242880.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_5242880.build.fs_start=271577088
adafruit_featherpicodebug.menu.flash.8388608_5242880.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
adafruit_featherpicodebug.menu.flash.8388608_6291456.upload.maximum_size=2093056
adafruit_featherpicodebug.menu.flash.8388608_6291456.build.flash_length=2093056
adafruit_featherpicodebug.menu.flash.8388608_6291456.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_6291456.build.fs_start=270528512
adafruit_featherpicodebug.menu.flash.8388608_6291456.build.fs_end=276819968
adafruit_featherpicodebug.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
adafruit_featherpicodebug.menu.flash.8388608_7340032.upload.maximum_size=1044480
adafruit_featherpicodebug.menu.flash.8388608_7340032.build.flash_length=1044480
adafruit_featherpicodebug.menu.flash.8388608_7340032.build.eeprom_start=276819968
adafruit_featherpicodebug.menu.flash.8388608_7340032.build.fs_start=269479936
adafruit_featherpicodebug.menu.flash.8388608_7340032.build.fs_end=276819968
adafruit_featherpicodebug.menu.freq.133=133 MHz
adafruit_featherpicodebug.menu.freq.133.build.f_cpu=133000000L
adafruit_featherpicodebug.menu.freq.50=50 MHz
adafruit_featherpicodebug.menu.freq.50.build.f_cpu=50000000L
adafruit_featherpicodebug.menu.freq.100=100 MHz
adafruit_featherpicodebug.menu.freq.100.build.f_cpu=100000000L
adafruit_featherpicodebug.menu.freq.120=120 MHz
adafruit_featherpicodebug.menu.freq.120.build.f_cpu=120000000L
adafruit_featherpicodebug.menu.freq.125=125 MHz
adafruit_featherpicodebug.menu.freq.125.build.f_cpu=125000000L
adafruit_featherpicodebug.menu.freq.150=150 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.150.build.f_cpu=150000000L
adafruit_featherpicodebug.menu.freq.175=175 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.175.build.f_cpu=175000000L
adafruit_featherpicodebug.menu.freq.200=200 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.200.build.f_cpu=200000000L
adafruit_featherpicodebug.menu.freq.225=225 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.225.build.f_cpu=225000000L
adafruit_featherpicodebug.menu.freq.240=240 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.240.build.f_cpu=240000000L
adafruit_featherpicodebug.menu.freq.250=250 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.250.build.f_cpu=250000000L
adafruit_featherpicodebug.menu.freq.275=275 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.275.build.f_cpu=275000000L
adafruit_featherpicodebug.menu.freq.300=300 MHz (Overclock)
adafruit_featherpicodebug.menu.freq.300.build.f_cpu=300000000L
adafruit_featherpicodebug.menu.opt.Small=Small (-Os) (standard)
adafruit_featherpicodebug.menu.opt.Small.build.flags.optimize=-Os
adafruit_featherpicodebug.menu.opt.Optimize=Optimize (-O)
adafruit_featherpicodebug.menu.opt.Optimize.build.flags.optimize=-O
adafruit_featherpicodebug.menu.opt.Optimize2=Optimize More (-O2)
adafruit_featherpicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
adafruit_featherpicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
adafruit_featherpicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
adafruit_featherpicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
adafruit_featherpicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
adafruit_featherpicodebug.menu.opt.Debug=Debug (-Og)
adafruit_featherpicodebug.menu.opt.Debug.build.flags.optimize=-Og
adafruit_featherpicodebug.menu.rtti.Disabled=Disabled
adafruit_featherpicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
adafruit_featherpicodebug.menu.rtti.Enabled=Enabled
adafruit_featherpicodebug.menu.rtti.Enabled.build.flags.rtti=
adafruit_featherpicodebug.menu.stackprotect.Disabled=Disabled
adafruit_featherpicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
adafruit_featherpicodebug.menu.stackprotect.Enabled=Enabled
adafruit_featherpicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
adafruit_featherpicodebug.menu.exceptions.Disabled=Disabled
adafruit_featherpicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
adafruit_featherpicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
adafruit_featherpicodebug.menu.exceptions.Enabled=Enabled
adafruit_featherpicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
adafruit_featherpicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
adafruit_featherpicodebug.menu.dbgport.Disabled=Disabled
adafruit_featherpicodebug.menu.dbgport.Disabled.build.debug_port=
adafruit_featherpicodebug.menu.dbgport.Serial=Serial
adafruit_featherpicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
adafruit_featherpicodebug.menu.dbgport.Serial1=Serial1
adafruit_featherpicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
adafruit_featherpicodebug.menu.dbgport.Serial2=Serial2
adafruit_featherpicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
adafruit_featherpicodebug.menu.dbglvl.None=None
adafruit_featherpicodebug.menu.dbglvl.None.build.debug_level=
adafruit_featherpicodebug.menu.dbglvl.Core=Core
adafruit_featherpicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
adafruit_featherpicodebug.menu.dbglvl.SPI=SPI
adafruit_featherpicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
adafruit_featherpicodebug.menu.dbglvl.Wire=Wire
adafruit_featherpicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
adafruit_featherpicodebug.menu.dbglvl.All=All
adafruit_featherpicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
adafruit_featherpicodebug.menu.dbglvl.NDEBUG=NDEBUG
adafruit_featherpicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
adafruit_featherpicodebug.menu.usbstack.nousb=No USB
adafruit_featherpicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
adafruit_featherpicodebug.menu.ipstack.ipv4only=IPv4 Only
adafruit_featherpicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
adafruit_featherpicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
adafruit_featherpicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
adafruit_featherpicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
adafruit_featherpicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

