earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Cytron Maker Pi RP2040
# -----------------------------------
cytron_maker_pi_rp2040.name=Cytron Maker Pi RP2040
cytron_maker_pi_rp2040.vid.0=0x2e8a
cytron_maker_pi_rp2040.pid.0=0x1000
cytron_maker_pi_rp2040.build.usbpid=-DSERIALUSB_PID=0x1000
cytron_maker_pi_rp2040.build.usbpwr=-DUSBD_MAX_POWER_MA=250
cytron_maker_pi_rp2040.build.board=CYTRON_MAKER_PI_RP2040
cytron_maker_pi_rp2040.build.mcu=cortex-m0plus
cytron_maker_pi_rp2040.build.variant=cytron_maker_pi_rp2040
cytron_maker_pi_rp2040.upload.tool=uf2conv
cytron_maker_pi_rp2040.upload.maximum_size=2097152
cytron_maker_pi_rp2040.upload.maximum_data_size=262144
cytron_maker_pi_rp2040.upload.wait_for_upload_port=true
cytron_maker_pi_rp2040.upload.erase_cmd=
cytron_maker_pi_rp2040.serial.disableDTR=false
cytron_maker_pi_rp2040.serial.disableRTS=false
cytron_maker_pi_rp2040.build.f_cpu=125000000
cytron_maker_pi_rp2040.build.led=
cytron_maker_pi_rp2040.build.core=rp2040
cytron_maker_pi_rp2040.build.ldscript=memmap_default.ld
cytron_maker_pi_rp2040.build.ram_length=256k
cytron_maker_pi_rp2040.build.boot2=boot2_w25q080_2_padded_checksum
cytron_maker_pi_rp2040.build.vid=0x2e8a
cytron_maker_pi_rp2040.build.pid=0x1000
cytron_maker_pi_rp2040.build.usb_manufacturer="Cytron"
cytron_maker_pi_rp2040.build.usb_product="Maker Pi RP2040"
cytron_maker_pi_rp2040.menu.flash.2097152_0=2MB (no FS)
cytron_maker_pi_rp2040.menu.flash.2097152_0.upload.maximum_size=2093056
cytron_maker_pi_rp2040.menu.flash.2097152_0.build.flash_length=2093056
cytron_maker_pi_rp2040.menu.flash.2097152_0.build.eeprom_start=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_0.build.fs_start=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_0.build.fs_end=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
cytron_maker_pi_rp2040.menu.flash.2097152_65536.upload.maximum_size=2027520
cytron_maker_pi_rp2040.menu.flash.2097152_65536.build.flash_length=2027520
cytron_maker_pi_rp2040.menu.flash.2097152_65536.build.eeprom_start=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_65536.build.fs_start=270462976
cytron_maker_pi_rp2040.menu.flash.2097152_65536.build.fs_end=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
cytron_maker_pi_rp2040.menu.flash.2097152_131072.upload.maximum_size=1961984
cytron_maker_pi_rp2040.menu.flash.2097152_131072.build.flash_length=1961984
cytron_maker_pi_rp2040.menu.flash.2097152_131072.build.eeprom_start=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_131072.build.fs_start=270397440
cytron_maker_pi_rp2040.menu.flash.2097152_131072.build.fs_end=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
cytron_maker_pi_rp2040.menu.flash.2097152_262144.upload.maximum_size=1830912
cytron_maker_pi_rp2040.menu.flash.2097152_262144.build.flash_length=1830912
cytron_maker_pi_rp2040.menu.flash.2097152_262144.build.eeprom_start=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_262144.build.fs_start=270266368
cytron_maker_pi_rp2040.menu.flash.2097152_262144.build.fs_end=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
cytron_maker_pi_rp2040.menu.flash.2097152_524288.upload.maximum_size=1568768
cytron_maker_pi_rp2040.menu.flash.2097152_524288.build.flash_length=1568768
cytron_maker_pi_rp2040.menu.flash.2097152_524288.build.eeprom_start=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_524288.build.fs_start=270004224
cytron_maker_pi_rp2040.menu.flash.2097152_524288.build.fs_end=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
cytron_maker_pi_rp2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
cytron_maker_pi_rp2040.menu.flash.2097152_1048576.build.flash_length=1044480
cytron_maker_pi_rp2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
cytron_maker_pi_rp2040.menu.flash.2097152_1048576.build.fs_start=269479936
cytron_maker_pi_rp2040.menu.flash.2097152_1048576.build.fs_end=270528512
cytron_maker_pi_rp2040.menu.freq.133=133 MHz
cytron_maker_pi_rp2040.menu.freq.133.build.f_cpu=133000000L
cytron_maker_pi_rp2040.menu.freq.50=50 MHz
cytron_maker_pi_rp2040.menu.freq.50.build.f_cpu=50000000L
cytron_maker_pi_rp2040.menu.freq.100=100 MHz
cytron_maker_pi_rp2040.menu.freq.100.build.f_cpu=100000000L
cytron_maker_pi_rp2040.menu.freq.120=120 MHz
cytron_maker_pi_rp2040.menu.freq.120.build.f_cpu=120000000L
cytron_maker_pi_rp2040.menu.freq.125=125 MHz
cytron_maker_pi_rp2040.menu.freq.125.build.f_cpu=125000000L
cytron_maker_pi_rp2040.menu.freq.150=150 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.150.build.f_cpu=150000000L
cytron_maker_pi_rp2040.menu.freq.175=175 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.175.build.f_cpu=175000000L
cytron_maker_pi_rp2040.menu.freq.200=200 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.200.build.f_cpu=200000000L
cytron_maker_pi_rp2040.menu.freq.225=225 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.225.build.f_cpu=225000000L
cytron_maker_pi_rp2040.menu.freq.240=240 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.240.build.f_cpu=240000000L
cytron_maker_pi_rp2040.menu.freq.250=250 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.250.build.f_cpu=250000000L
cytron_maker_pi_rp2040.menu.freq.275=275 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.275.build.f_cpu=275000000L
cytron_maker_pi_rp2040.menu.freq.300=300 MHz (Overclock)
cytron_maker_pi_rp2040.menu.freq.300.build.f_cpu=300000000L
cytron_maker_pi_rp2040.menu.opt.Small=Small (-Os) (standard)
cytron_maker_pi_rp2040.menu.opt.Small.build.flags.optimize=-Os
cytron_maker_pi_rp2040.menu.opt.Optimize=Optimize (-O)
cytron_maker_pi_rp2040.menu.opt.Optimize.build.flags.optimize=-O
cytron_maker_pi_rp2040.menu.opt.Optimize2=Optimize More (-O2)
cytron_maker_pi_rp2040.menu.opt.Optimize2.build.flags.optimize=-O2
cytron_maker_pi_rp2040.menu.opt.Optimize3=Optimize Even More (-O3)
cytron_maker_pi_rp2040.menu.opt.Optimize3.build.flags.optimize=-O3
cytron_maker_pi_rp2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
cytron_maker_pi_rp2040.menu.opt.Fast.build.flags.optimize=-Ofast
cytron_maker_pi_rp2040.menu.opt.Debug=Debug (-Og)
cytron_maker_pi_rp2040.menu.opt.Debug.build.flags.optimize=-Og
cytron_maker_pi_rp2040.menu.rtti.Disabled=Disabled
cytron_maker_pi_rp2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
cytron_maker_pi_rp2040.menu.rtti.Enabled=Enabled
cytron_maker_pi_rp2040.menu.rtti.Enabled.build.flags.rtti=
cytron_maker_pi_rp2040.menu.stackprotect.Disabled=Disabled
cytron_maker_pi_rp2040.menu.stackprotect.Disabled.build.flags.stackprotect=
cytron_maker_pi_rp2040.menu.stackprotect.Enabled=Enabled
cytron_maker_pi_rp2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
cytron_maker_pi_rp2040.menu.exceptions.Disabled=Disabled
cytron_maker_pi_rp2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
cytron_maker_pi_rp2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
cytron_maker_pi_rp2040.menu.exceptions.Enabled=Enabled
cytron_maker_pi_rp2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
cytron_maker_pi_rp2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
cytron_maker_pi_rp2040.menu.dbgport.Disabled=Disabled
cytron_maker_pi_rp2040.menu.dbgport.Disabled.build.debug_port=
cytron_maker_pi_rp2040.menu.dbgport.Serial=Serial
cytron_maker_pi_rp2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
cytron_maker_pi_rp2040.menu.dbgport.Serial1=Serial1
cytron_maker_pi_rp2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
cytron_maker_pi_rp2040.menu.dbgport.Serial2=Serial2
cytron_maker_pi_rp2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
cytron_maker_pi_rp2040.menu.dbglvl.None=None
cytron_maker_pi_rp2040.menu.dbglvl.None.build.debug_level=
cytron_maker_pi_rp2040.menu.dbglvl.Core=Core
cytron_maker_pi_rp2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
cytron_maker_pi_rp2040.menu.dbglvl.SPI=SPI
cytron_maker_pi_rp2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
cytron_maker_pi_rp2040.menu.dbglvl.Wire=Wire
cytron_maker_pi_rp2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
cytron_maker_pi_rp2040.menu.dbglvl.All=All
cytron_maker_pi_rp2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
cytron_maker_pi_rp2040.menu.dbglvl.NDEBUG=NDEBUG
cytron_maker_pi_rp2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
cytron_maker_pi_rp2040.menu.usbstack.picosdk=Pico SDK
cytron_maker_pi_rp2040.menu.usbstack.picosdk.build.usbstack_flags=
cytron_maker_pi_rp2040.menu.usbstack.tinyusb=Adafruit TinyUSB
cytron_maker_pi_rp2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
cytron_maker_pi_rp2040.menu.ipstack.ipv4only=IPv4 Only
cytron_maker_pi_rp2040.menu.ipstack.ipv4only.build.libpico=libpico.a
cytron_maker_pi_rp2040.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
cytron_maker_pi_rp2040.menu.ipstack.ipv4ipv6=IPv4 and IPv6
cytron_maker_pi_rp2040.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
cytron_maker_pi_rp2040.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

