earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# DeRuiLab FlyBoard2040Core (pico-debug)
# -----------------------------------
flyboard2040_corepicodebug.name=DeRuiLab FlyBoard2040Core (pico-debug)
flyboard2040_corepicodebug.vid.0=0x1209
flyboard2040_corepicodebug.pid.0=0x2488
flyboard2040_corepicodebug.build.usbpid=-DSERIALUSB_PID=0x008a
flyboard2040_corepicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=500
flyboard2040_corepicodebug.build.board=FLYBOARD2040_CORE
flyboard2040_corepicodebug.build.mcu=cortex-m0plus
flyboard2040_corepicodebug.build.variant=flyboard2040_core
flyboard2040_corepicodebug.upload.tool=picodebug
flyboard2040_corepicodebug.upload.maximum_size=4194304
flyboard2040_corepicodebug.upload.maximum_data_size=245760
flyboard2040_corepicodebug.upload.wait_for_upload_port=true
flyboard2040_corepicodebug.upload.erase_cmd=
flyboard2040_corepicodebug.serial.disableDTR=false
flyboard2040_corepicodebug.serial.disableRTS=false
flyboard2040_corepicodebug.build.f_cpu=125000000
flyboard2040_corepicodebug.build.led=
flyboard2040_corepicodebug.build.core=rp2040
flyboard2040_corepicodebug.build.ldscript=memmap_default.ld
flyboard2040_corepicodebug.build.ram_length=240k
flyboard2040_corepicodebug.build.boot2=boot2_generic_03h_4_padded_checksum
flyboard2040_corepicodebug.build.vid=0x2e8a
flyboard2040_corepicodebug.build.pid=0x008a
flyboard2040_corepicodebug.build.usb_manufacturer="DeRuiLab"
flyboard2040_corepicodebug.build.usb_product="FlyBoard2040Core (pico-debug)"
flyboard2040_corepicodebug.menu.flash.4194304_0=4MB (no FS)
flyboard2040_corepicodebug.menu.flash.4194304_0.upload.maximum_size=4190208
flyboard2040_corepicodebug.menu.flash.4194304_0.build.flash_length=4190208
flyboard2040_corepicodebug.menu.flash.4194304_0.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_0.build.fs_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_0.build.fs_end=272625664
flyboard2040_corepicodebug.menu.flash.4194304_65536=4MB (Sketch: 4032KB, FS: 64KB)
flyboard2040_corepicodebug.menu.flash.4194304_65536.upload.maximum_size=4124672
flyboard2040_corepicodebug.menu.flash.4194304_65536.build.flash_length=4124672
flyboard2040_corepicodebug.menu.flash.4194304_65536.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_65536.build.fs_start=272560128
flyboard2040_corepicodebug.menu.flash.4194304_65536.build.fs_end=272625664
flyboard2040_corepicodebug.menu.flash.4194304_131072=4MB (Sketch: 3968KB, FS: 128KB)
flyboard2040_corepicodebug.menu.flash.4194304_131072.upload.maximum_size=4059136
flyboard2040_corepicodebug.menu.flash.4194304_131072.build.flash_length=4059136
flyboard2040_corepicodebug.menu.flash.4194304_131072.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_131072.build.fs_start=272494592
flyboard2040_corepicodebug.menu.flash.4194304_131072.build.fs_end=272625664
flyboard2040_corepicodebug.menu.flash.4194304_262144=4MB (Sketch: 3840KB, FS: 256KB)
flyboard2040_corepicodebug.menu.flash.4194304_262144.upload.maximum_size=3928064
flyboard2040_corepicodebug.menu.flash.4194304_262144.build.flash_length=3928064
flyboard2040_corepicodebug.menu.flash.4194304_262144.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_262144.build.fs_start=272363520
flyboard2040_corepicodebug.menu.flash.4194304_262144.build.fs_end=272625664
flyboard2040_corepicodebug.menu.flash.4194304_524288=4MB (Sketch: 3584KB, FS: 512KB)
flyboard2040_corepicodebug.menu.flash.4194304_524288.upload.maximum_size=3665920
flyboard2040_corepicodebug.menu.flash.4194304_524288.build.flash_length=3665920
flyboard2040_corepicodebug.menu.flash.4194304_524288.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_524288.build.fs_start=272101376
flyboard2040_corepicodebug.menu.flash.4194304_524288.build.fs_end=272625664
flyboard2040_corepicodebug.menu.flash.4194304_1048576=4MB (Sketch: 3MB, FS: 1MB)
flyboard2040_corepicodebug.menu.flash.4194304_1048576.upload.maximum_size=3141632
flyboard2040_corepicodebug.menu.flash.4194304_1048576.build.flash_length=3141632
flyboard2040_corepicodebug.menu.flash.4194304_1048576.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_1048576.build.fs_start=271577088
flyboard2040_corepicodebug.menu.flash.4194304_1048576.build.fs_end=272625664
flyboard2040_corepicodebug.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
flyboard2040_corepicodebug.menu.flash.4194304_2097152.upload.maximum_size=2093056
flyboard2040_corepicodebug.menu.flash.4194304_2097152.build.flash_length=2093056
flyboard2040_corepicodebug.menu.flash.4194304_2097152.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_2097152.build.fs_start=270528512
flyboard2040_corepicodebug.menu.flash.4194304_2097152.build.fs_end=272625664
flyboard2040_corepicodebug.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
flyboard2040_corepicodebug.menu.flash.4194304_3145728.upload.maximum_size=1044480
flyboard2040_corepicodebug.menu.flash.4194304_3145728.build.flash_length=1044480
flyboard2040_corepicodebug.menu.flash.4194304_3145728.build.eeprom_start=272625664
flyboard2040_corepicodebug.menu.flash.4194304_3145728.build.fs_start=269479936
flyboard2040_corepicodebug.menu.flash.4194304_3145728.build.fs_end=272625664
flyboard2040_corepicodebug.menu.freq.133=133 MHz
flyboard2040_corepicodebug.menu.freq.133.build.f_cpu=133000000L
flyboard2040_corepicodebug.menu.freq.50=50 MHz
flyboard2040_corepicodebug.menu.freq.50.build.f_cpu=50000000L
flyboard2040_corepicodebug.menu.freq.100=100 MHz
flyboard2040_corepicodebug.menu.freq.100.build.f_cpu=100000000L
flyboard2040_corepicodebug.menu.freq.120=120 MHz
flyboard2040_corepicodebug.menu.freq.120.build.f_cpu=120000000L
flyboard2040_corepicodebug.menu.freq.125=125 MHz
flyboard2040_corepicodebug.menu.freq.125.build.f_cpu=125000000L
flyboard2040_corepicodebug.menu.freq.150=150 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.150.build.f_cpu=150000000L
flyboard2040_corepicodebug.menu.freq.175=175 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.175.build.f_cpu=175000000L
flyboard2040_corepicodebug.menu.freq.200=200 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.200.build.f_cpu=200000000L
flyboard2040_corepicodebug.menu.freq.225=225 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.225.build.f_cpu=225000000L
flyboard2040_corepicodebug.menu.freq.240=240 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.240.build.f_cpu=240000000L
flyboard2040_corepicodebug.menu.freq.250=250 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.250.build.f_cpu=250000000L
flyboard2040_corepicodebug.menu.freq.275=275 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.275.build.f_cpu=275000000L
flyboard2040_corepicodebug.menu.freq.300=300 MHz (Overclock)
flyboard2040_corepicodebug.menu.freq.300.build.f_cpu=300000000L
flyboard2040_corepicodebug.menu.opt.Small=Small (-Os) (standard)
flyboard2040_corepicodebug.menu.opt.Small.build.flags.optimize=-Os
flyboard2040_corepicodebug.menu.opt.Optimize=Optimize (-O)
flyboard2040_corepicodebug.menu.opt.Optimize.build.flags.optimize=-O
flyboard2040_corepicodebug.menu.opt.Optimize2=Optimize More (-O2)
flyboard2040_corepicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
flyboard2040_corepicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
flyboard2040_corepicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
flyboard2040_corepicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
flyboard2040_corepicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
flyboard2040_corepicodebug.menu.opt.Debug=Debug (-Og)
flyboard2040_corepicodebug.menu.opt.Debug.build.flags.optimize=-Og
flyboard2040_corepicodebug.menu.rtti.Disabled=Disabled
flyboard2040_corepicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
flyboard2040_corepicodebug.menu.rtti.Enabled=Enabled
flyboard2040_corepicodebug.menu.rtti.Enabled.build.flags.rtti=
flyboard2040_corepicodebug.menu.stackprotect.Disabled=Disabled
flyboard2040_corepicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
flyboard2040_corepicodebug.menu.stackprotect.Enabled=Enabled
flyboard2040_corepicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
flyboard2040_corepicodebug.menu.exceptions.Disabled=Disabled
flyboard2040_corepicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
flyboard2040_corepicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
flyboard2040_corepicodebug.menu.exceptions.Enabled=Enabled
flyboard2040_corepicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
flyboard2040_corepicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
flyboard2040_corepicodebug.menu.dbgport.Disabled=Disabled
flyboard2040_corepicodebug.menu.dbgport.Disabled.build.debug_port=
flyboard2040_corepicodebug.menu.dbgport.Serial=Serial
flyboard2040_corepicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
flyboard2040_corepicodebug.menu.dbgport.Serial1=Serial1
flyboard2040_corepicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
flyboard2040_corepicodebug.menu.dbgport.Serial2=Serial2
flyboard2040_corepicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
flyboard2040_corepicodebug.menu.dbglvl.None=None
flyboard2040_corepicodebug.menu.dbglvl.None.build.debug_level=
flyboard2040_corepicodebug.menu.dbglvl.Core=Core
flyboard2040_corepicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
flyboard2040_corepicodebug.menu.dbglvl.SPI=SPI
flyboard2040_corepicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
flyboard2040_corepicodebug.menu.dbglvl.Wire=Wire
flyboard2040_corepicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
flyboard2040_corepicodebug.menu.dbglvl.All=All
flyboard2040_corepicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
flyboard2040_corepicodebug.menu.dbglvl.NDEBUG=NDEBUG
flyboard2040_corepicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
flyboard2040_corepicodebug.menu.usbstack.nousb=No USB
flyboard2040_corepicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
flyboard2040_corepicodebug.menu.ipstack.ipv4only=IPv4 Only
flyboard2040_corepicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
flyboard2040_corepicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
flyboard2040_corepicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
flyboard2040_corepicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
flyboard2040_corepicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

