earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# iLabs RPICO32 (Picoprobe)
# -----------------------------------
ilabs_rpico32picoprobe.name=iLabs RPICO32 (Picoprobe)
ilabs_rpico32picoprobe.vid.0=0x2e8a
ilabs_rpico32picoprobe.pid.0=0x0004
ilabs_rpico32picoprobe.build.usbpid=-DSERIALUSB_PID=0x1010
ilabs_rpico32picoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
ilabs_rpico32picoprobe.build.board=ILABS_2040_RPICO32_RP2040
ilabs_rpico32picoprobe.build.mcu=cortex-m0plus
ilabs_rpico32picoprobe.build.variant=ilabs_rpico32
ilabs_rpico32picoprobe.upload.tool=picoprobe
ilabs_rpico32picoprobe.upload.maximum_size=8388608
ilabs_rpico32picoprobe.upload.maximum_data_size=262144
ilabs_rpico32picoprobe.upload.wait_for_upload_port=true
ilabs_rpico32picoprobe.upload.erase_cmd=
ilabs_rpico32picoprobe.serial.disableDTR=false
ilabs_rpico32picoprobe.serial.disableRTS=false
ilabs_rpico32picoprobe.build.f_cpu=125000000
ilabs_rpico32picoprobe.build.led=
ilabs_rpico32picoprobe.build.core=rp2040
ilabs_rpico32picoprobe.build.ldscript=memmap_default.ld
ilabs_rpico32picoprobe.build.ram_length=256k
ilabs_rpico32picoprobe.build.boot2=boot2_w25q080_2_padded_checksum
ilabs_rpico32picoprobe.build.vid=0x2e8a
ilabs_rpico32picoprobe.build.pid=0x1010
ilabs_rpico32picoprobe.build.usb_manufacturer="iLabs"
ilabs_rpico32picoprobe.build.usb_product="RPICO32 (Picoprobe)"
ilabs_rpico32picoprobe.menu.flash.8388608_0=8MB (no FS)
ilabs_rpico32picoprobe.menu.flash.8388608_0.upload.maximum_size=8384512
ilabs_rpico32picoprobe.menu.flash.8388608_0.build.flash_length=8384512
ilabs_rpico32picoprobe.menu.flash.8388608_0.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_0.build.fs_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_0.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_65536=8MB (Sketch: 8128KB, FS: 64KB)
ilabs_rpico32picoprobe.menu.flash.8388608_65536.upload.maximum_size=8318976
ilabs_rpico32picoprobe.menu.flash.8388608_65536.build.flash_length=8318976
ilabs_rpico32picoprobe.menu.flash.8388608_65536.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_65536.build.fs_start=276754432
ilabs_rpico32picoprobe.menu.flash.8388608_65536.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_131072=8MB (Sketch: 8064KB, FS: 128KB)
ilabs_rpico32picoprobe.menu.flash.8388608_131072.upload.maximum_size=8253440
ilabs_rpico32picoprobe.menu.flash.8388608_131072.build.flash_length=8253440
ilabs_rpico32picoprobe.menu.flash.8388608_131072.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_131072.build.fs_start=276688896
ilabs_rpico32picoprobe.menu.flash.8388608_131072.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_262144=8MB (Sketch: 7936KB, FS: 256KB)
ilabs_rpico32picoprobe.menu.flash.8388608_262144.upload.maximum_size=8122368
ilabs_rpico32picoprobe.menu.flash.8388608_262144.build.flash_length=8122368
ilabs_rpico32picoprobe.menu.flash.8388608_262144.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_262144.build.fs_start=276557824
ilabs_rpico32picoprobe.menu.flash.8388608_262144.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_524288=8MB (Sketch: 7680KB, FS: 512KB)
ilabs_rpico32picoprobe.menu.flash.8388608_524288.upload.maximum_size=7860224
ilabs_rpico32picoprobe.menu.flash.8388608_524288.build.flash_length=7860224
ilabs_rpico32picoprobe.menu.flash.8388608_524288.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_524288.build.fs_start=276295680
ilabs_rpico32picoprobe.menu.flash.8388608_524288.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_1048576=8MB (Sketch: 7MB, FS: 1MB)
ilabs_rpico32picoprobe.menu.flash.8388608_1048576.upload.maximum_size=7335936
ilabs_rpico32picoprobe.menu.flash.8388608_1048576.build.flash_length=7335936
ilabs_rpico32picoprobe.menu.flash.8388608_1048576.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_1048576.build.fs_start=275771392
ilabs_rpico32picoprobe.menu.flash.8388608_1048576.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
ilabs_rpico32picoprobe.menu.flash.8388608_2097152.upload.maximum_size=6287360
ilabs_rpico32picoprobe.menu.flash.8388608_2097152.build.flash_length=6287360
ilabs_rpico32picoprobe.menu.flash.8388608_2097152.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_2097152.build.fs_start=274722816
ilabs_rpico32picoprobe.menu.flash.8388608_2097152.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_3145728=8MB (Sketch: 5MB, FS: 3MB)
ilabs_rpico32picoprobe.menu.flash.8388608_3145728.upload.maximum_size=5238784
ilabs_rpico32picoprobe.menu.flash.8388608_3145728.build.flash_length=5238784
ilabs_rpico32picoprobe.menu.flash.8388608_3145728.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_3145728.build.fs_start=273674240
ilabs_rpico32picoprobe.menu.flash.8388608_3145728.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
ilabs_rpico32picoprobe.menu.flash.8388608_4194304.upload.maximum_size=4190208
ilabs_rpico32picoprobe.menu.flash.8388608_4194304.build.flash_length=4190208
ilabs_rpico32picoprobe.menu.flash.8388608_4194304.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_4194304.build.fs_start=272625664
ilabs_rpico32picoprobe.menu.flash.8388608_4194304.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_5242880=8MB (Sketch: 3MB, FS: 5MB)
ilabs_rpico32picoprobe.menu.flash.8388608_5242880.upload.maximum_size=3141632
ilabs_rpico32picoprobe.menu.flash.8388608_5242880.build.flash_length=3141632
ilabs_rpico32picoprobe.menu.flash.8388608_5242880.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_5242880.build.fs_start=271577088
ilabs_rpico32picoprobe.menu.flash.8388608_5242880.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_6291456=8MB (Sketch: 2MB, FS: 6MB)
ilabs_rpico32picoprobe.menu.flash.8388608_6291456.upload.maximum_size=2093056
ilabs_rpico32picoprobe.menu.flash.8388608_6291456.build.flash_length=2093056
ilabs_rpico32picoprobe.menu.flash.8388608_6291456.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_6291456.build.fs_start=270528512
ilabs_rpico32picoprobe.menu.flash.8388608_6291456.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
ilabs_rpico32picoprobe.menu.flash.8388608_7340032.upload.maximum_size=1044480
ilabs_rpico32picoprobe.menu.flash.8388608_7340032.build.flash_length=1044480
ilabs_rpico32picoprobe.menu.flash.8388608_7340032.build.eeprom_start=276819968
ilabs_rpico32picoprobe.menu.flash.8388608_7340032.build.fs_start=269479936
ilabs_rpico32picoprobe.menu.flash.8388608_7340032.build.fs_end=276819968
ilabs_rpico32picoprobe.menu.freq.133=133 MHz
ilabs_rpico32picoprobe.menu.freq.133.build.f_cpu=133000000L
ilabs_rpico32picoprobe.menu.freq.50=50 MHz
ilabs_rpico32picoprobe.menu.freq.50.build.f_cpu=50000000L
ilabs_rpico32picoprobe.menu.freq.100=100 MHz
ilabs_rpico32picoprobe.menu.freq.100.build.f_cpu=100000000L
ilabs_rpico32picoprobe.menu.freq.120=120 MHz
ilabs_rpico32picoprobe.menu.freq.120.build.f_cpu=120000000L
ilabs_rpico32picoprobe.menu.freq.125=125 MHz
ilabs_rpico32picoprobe.menu.freq.125.build.f_cpu=125000000L
ilabs_rpico32picoprobe.menu.freq.150=150 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.150.build.f_cpu=150000000L
ilabs_rpico32picoprobe.menu.freq.175=175 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.175.build.f_cpu=175000000L
ilabs_rpico32picoprobe.menu.freq.200=200 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.200.build.f_cpu=200000000L
ilabs_rpico32picoprobe.menu.freq.225=225 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.225.build.f_cpu=225000000L
ilabs_rpico32picoprobe.menu.freq.240=240 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.240.build.f_cpu=240000000L
ilabs_rpico32picoprobe.menu.freq.250=250 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.250.build.f_cpu=250000000L
ilabs_rpico32picoprobe.menu.freq.275=275 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.275.build.f_cpu=275000000L
ilabs_rpico32picoprobe.menu.freq.300=300 MHz (Overclock)
ilabs_rpico32picoprobe.menu.freq.300.build.f_cpu=300000000L
ilabs_rpico32picoprobe.menu.opt.Small=Small (-Os) (standard)
ilabs_rpico32picoprobe.menu.opt.Small.build.flags.optimize=-Os
ilabs_rpico32picoprobe.menu.opt.Optimize=Optimize (-O)
ilabs_rpico32picoprobe.menu.opt.Optimize.build.flags.optimize=-O
ilabs_rpico32picoprobe.menu.opt.Optimize2=Optimize More (-O2)
ilabs_rpico32picoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
ilabs_rpico32picoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
ilabs_rpico32picoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
ilabs_rpico32picoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
ilabs_rpico32picoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
ilabs_rpico32picoprobe.menu.opt.Debug=Debug (-Og)
ilabs_rpico32picoprobe.menu.opt.Debug.build.flags.optimize=-Og
ilabs_rpico32picoprobe.menu.rtti.Disabled=Disabled
ilabs_rpico32picoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
ilabs_rpico32picoprobe.menu.rtti.Enabled=Enabled
ilabs_rpico32picoprobe.menu.rtti.Enabled.build.flags.rtti=
ilabs_rpico32picoprobe.menu.stackprotect.Disabled=Disabled
ilabs_rpico32picoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
ilabs_rpico32picoprobe.menu.stackprotect.Enabled=Enabled
ilabs_rpico32picoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
ilabs_rpico32picoprobe.menu.exceptions.Disabled=Disabled
ilabs_rpico32picoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
ilabs_rpico32picoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
ilabs_rpico32picoprobe.menu.exceptions.Enabled=Enabled
ilabs_rpico32picoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
ilabs_rpico32picoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
ilabs_rpico32picoprobe.menu.dbgport.Disabled=Disabled
ilabs_rpico32picoprobe.menu.dbgport.Disabled.build.debug_port=
ilabs_rpico32picoprobe.menu.dbgport.Serial=Serial
ilabs_rpico32picoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
ilabs_rpico32picoprobe.menu.dbgport.Serial1=Serial1
ilabs_rpico32picoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
ilabs_rpico32picoprobe.menu.dbgport.Serial2=Serial2
ilabs_rpico32picoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
ilabs_rpico32picoprobe.menu.dbglvl.None=None
ilabs_rpico32picoprobe.menu.dbglvl.None.build.debug_level=
ilabs_rpico32picoprobe.menu.dbglvl.Core=Core
ilabs_rpico32picoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
ilabs_rpico32picoprobe.menu.dbglvl.SPI=SPI
ilabs_rpico32picoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
ilabs_rpico32picoprobe.menu.dbglvl.Wire=Wire
ilabs_rpico32picoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
ilabs_rpico32picoprobe.menu.dbglvl.All=All
ilabs_rpico32picoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
ilabs_rpico32picoprobe.menu.dbglvl.NDEBUG=NDEBUG
ilabs_rpico32picoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
ilabs_rpico32picoprobe.menu.usbstack.picosdk=Pico SDK
ilabs_rpico32picoprobe.menu.usbstack.picosdk.build.usbstack_flags=
ilabs_rpico32picoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
ilabs_rpico32picoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
ilabs_rpico32picoprobe.menu.ipstack.ipv4only=IPv4 Only
ilabs_rpico32picoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
ilabs_rpico32picoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
ilabs_rpico32picoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
ilabs_rpico32picoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
ilabs_rpico32picoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

