earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# WIZnet WizFi360-EVB-Pico
# -----------------------------------
wiznet_wizfi360_evb_pico.name=WIZnet WizFi360-EVB-Pico
wiznet_wizfi360_evb_pico.vid.0=0x2e8a
wiznet_wizfi360_evb_pico.pid.0=0x1028
wiznet_wizfi360_evb_pico.build.usbpid=-DSERIALUSB_PID=0x1028
wiznet_wizfi360_evb_pico.build.usbpwr=-DUSBD_MAX_POWER_MA=250
wiznet_wizfi360_evb_pico.build.board=WIZNET_WIZFI360_EVB_PICO
wiznet_wizfi360_evb_pico.build.mcu=cortex-m0plus
wiznet_wizfi360_evb_pico.build.variant=wiznet_wizfi360_evb_pico
wiznet_wizfi360_evb_pico.upload.tool=uf2conv
wiznet_wizfi360_evb_pico.upload.maximum_size=2097152
wiznet_wizfi360_evb_pico.upload.maximum_data_size=262144
wiznet_wizfi360_evb_pico.upload.wait_for_upload_port=true
wiznet_wizfi360_evb_pico.upload.erase_cmd=
wiznet_wizfi360_evb_pico.serial.disableDTR=false
wiznet_wizfi360_evb_pico.serial.disableRTS=false
wiznet_wizfi360_evb_pico.build.f_cpu=125000000
wiznet_wizfi360_evb_pico.build.led=
wiznet_wizfi360_evb_pico.build.core=rp2040
wiznet_wizfi360_evb_pico.build.ldscript=memmap_default.ld
wiznet_wizfi360_evb_pico.build.ram_length=256k
wiznet_wizfi360_evb_pico.build.boot2=boot2_w25q080_2_padded_checksum
wiznet_wizfi360_evb_pico.build.vid=0x2e8a
wiznet_wizfi360_evb_pico.build.pid=0x1028
wiznet_wizfi360_evb_pico.build.usb_manufacturer="WIZnet"
wiznet_wizfi360_evb_pico.build.usb_product="WizFi360-EVB-Pico"
wiznet_wizfi360_evb_pico.menu.flash.2097152_0=2MB (no FS)
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.upload.maximum_size=2093056
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.flash_length=2093056
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.fs_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.upload.maximum_size=2027520
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.flash_length=2027520
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.fs_start=270462976
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.upload.maximum_size=1961984
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.flash_length=1961984
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.fs_start=270397440
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.upload.maximum_size=1830912
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.flash_length=1830912
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.fs_start=270266368
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.upload.maximum_size=1568768
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.flash_length=1568768
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.fs_start=270004224
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.upload.maximum_size=1044480
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.flash_length=1044480
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.fs_start=269479936
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.freq.133=133 MHz
wiznet_wizfi360_evb_pico.menu.freq.133.build.f_cpu=133000000L
wiznet_wizfi360_evb_pico.menu.freq.50=50 MHz
wiznet_wizfi360_evb_pico.menu.freq.50.build.f_cpu=50000000L
wiznet_wizfi360_evb_pico.menu.freq.100=100 MHz
wiznet_wizfi360_evb_pico.menu.freq.100.build.f_cpu=100000000L
wiznet_wizfi360_evb_pico.menu.freq.120=120 MHz
wiznet_wizfi360_evb_pico.menu.freq.120.build.f_cpu=120000000L
wiznet_wizfi360_evb_pico.menu.freq.125=125 MHz
wiznet_wizfi360_evb_pico.menu.freq.125.build.f_cpu=125000000L
wiznet_wizfi360_evb_pico.menu.freq.150=150 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.150.build.f_cpu=150000000L
wiznet_wizfi360_evb_pico.menu.freq.175=175 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.175.build.f_cpu=175000000L
wiznet_wizfi360_evb_pico.menu.freq.200=200 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.200.build.f_cpu=200000000L
wiznet_wizfi360_evb_pico.menu.freq.225=225 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.225.build.f_cpu=225000000L
wiznet_wizfi360_evb_pico.menu.freq.240=240 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.240.build.f_cpu=240000000L
wiznet_wizfi360_evb_pico.menu.freq.250=250 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.250.build.f_cpu=250000000L
wiznet_wizfi360_evb_pico.menu.freq.275=275 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.275.build.f_cpu=275000000L
wiznet_wizfi360_evb_pico.menu.freq.300=300 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.300.build.f_cpu=300000000L
wiznet_wizfi360_evb_pico.menu.opt.Small=Small (-Os) (standard)
wiznet_wizfi360_evb_pico.menu.opt.Small.build.flags.optimize=-Os
wiznet_wizfi360_evb_pico.menu.opt.Optimize=Optimize (-O)
wiznet_wizfi360_evb_pico.menu.opt.Optimize.build.flags.optimize=-O
wiznet_wizfi360_evb_pico.menu.opt.Optimize2=Optimize More (-O2)
wiznet_wizfi360_evb_pico.menu.opt.Optimize2.build.flags.optimize=-O2
wiznet_wizfi360_evb_pico.menu.opt.Optimize3=Optimize Even More (-O3)
wiznet_wizfi360_evb_pico.menu.opt.Optimize3.build.flags.optimize=-O3
wiznet_wizfi360_evb_pico.menu.opt.Fast=Fast (-Ofast) (maybe slower)
wiznet_wizfi360_evb_pico.menu.opt.Fast.build.flags.optimize=-Ofast
wiznet_wizfi360_evb_pico.menu.opt.Debug=Debug (-Og)
wiznet_wizfi360_evb_pico.menu.opt.Debug.build.flags.optimize=-Og
wiznet_wizfi360_evb_pico.menu.rtti.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
wiznet_wizfi360_evb_pico.menu.rtti.Enabled=Enabled
wiznet_wizfi360_evb_pico.menu.rtti.Enabled.build.flags.rtti=
wiznet_wizfi360_evb_pico.menu.stackprotect.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.stackprotect.Disabled.build.flags.stackprotect=
wiznet_wizfi360_evb_pico.menu.stackprotect.Enabled=Enabled
wiznet_wizfi360_evb_pico.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
wiznet_wizfi360_evb_pico.menu.exceptions.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
wiznet_wizfi360_evb_pico.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
wiznet_wizfi360_evb_pico.menu.exceptions.Enabled=Enabled
wiznet_wizfi360_evb_pico.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
wiznet_wizfi360_evb_pico.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
wiznet_wizfi360_evb_pico.menu.dbgport.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.dbgport.Disabled.build.debug_port=
wiznet_wizfi360_evb_pico.menu.dbgport.Serial=Serial
wiznet_wizfi360_evb_pico.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
wiznet_wizfi360_evb_pico.menu.dbgport.Serial1=Serial1
wiznet_wizfi360_evb_pico.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
wiznet_wizfi360_evb_pico.menu.dbgport.Serial2=Serial2
wiznet_wizfi360_evb_pico.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
wiznet_wizfi360_evb_pico.menu.dbglvl.None=None
wiznet_wizfi360_evb_pico.menu.dbglvl.None.build.debug_level=
wiznet_wizfi360_evb_pico.menu.dbglvl.Core=Core
wiznet_wizfi360_evb_pico.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
wiznet_wizfi360_evb_pico.menu.dbglvl.SPI=SPI
wiznet_wizfi360_evb_pico.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
wiznet_wizfi360_evb_pico.menu.dbglvl.Wire=Wire
wiznet_wizfi360_evb_pico.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
wiznet_wizfi360_evb_pico.menu.dbglvl.All=All
wiznet_wizfi360_evb_pico.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
wiznet_wizfi360_evb_pico.menu.dbglvl.NDEBUG=NDEBUG
wiznet_wizfi360_evb_pico.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
wiznet_wizfi360_evb_pico.menu.usbstack.picosdk=Pico SDK
wiznet_wizfi360_evb_pico.menu.usbstack.picosdk.build.usbstack_flags=
wiznet_wizfi360_evb_pico.menu.usbstack.tinyusb=Adafruit TinyUSB
wiznet_wizfi360_evb_pico.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
wiznet_wizfi360_evb_pico.menu.ipstack.ipv4only=IPv4 Only
wiznet_wizfi360_evb_pico.menu.ipstack.ipv4only.build.libpico=libpico.a
wiznet_wizfi360_evb_pico.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
wiznet_wizfi360_evb_pico.menu.ipstack.ipv4ipv6=IPv4 and IPv6
wiznet_wizfi360_evb_pico.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
wiznet_wizfi360_evb_pico.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1

